let ymny = [
	"Андрусишин Олег",
	"Балицький Олексій",
	"Барановський Ігор",
	"Бей Тетяна",
	"Білас Всеволод",
	"Білоус Андрій",
	"Бордун Галина",
	"Буба Євген",
	"Вантух Володимир",
	"Васьків Роман",
	"Вервега Тарас",
	"Візняк Юрій",
	"Гагалюк Богдан",
	"Ганущин Олександр",
	"Гичка Михайло",
	"Гірняк Володимир",
	"Голуб Юрій",
	"Грабінський Ігор",
	"Грицик Ольга",
	"Гудима Юрій",
	"Дворянин Парасковія",
	"Дейнека Анатолій",
	"Демчина Роман",
	"Дзюдзь Михайло"
];
let misshok =document.getElementById(`tyble`)
let  widro ='';
let  chhek = '';
let ima = prompt('Імя?');
for(i=0 ; i<ymny.length ; i++ ){
 if(ymny[i].includes(ima)){
    chhek = 'checked'
    }else{
        chhek = ''
}
   
widro +=`
<tr>
                <td>${i+1}</td>
                <td>${ymny[i]}</td>
                <td align="center"><input type="checkbox" ${chhek}></td>
            </tr>
`

}

misshok.innerHTML = widro;